Tekla Open API Reference for Tekla Structures 2025
Matrix.Transform Method
Overload List
Name | Description
Transform(IEnumerable<Point>)
 Transforms the given points using the current matrix.
Transform(Point)
 Transforms the given point using the current matrix.
Top
See Also
Reference
Matrix Class
Tekla.Structures.Geometry3d Namespace